# გადასახადის საწყისი თანხა
total_due = 50
print(f"გადასახდელი თანხაა: {total_due} ლარი")

# ვალიდური კუპიურების სია
valid_bills = {5, 10, 20}
# მომხმარებლის მიერ შეტანილი ჯამური თანხა
total_paid = 0

# მანამ სანამ გადასახდელი თანხა ნულზე მეტია
while total_due > 0:
    bill = int(input("მოათავსეთ კუპიურა (5, 10 ან 20 ლარიანი): "))

    # კუპიურის ვალიდურობის შემოწმება
    if bill not in valid_bills:
        print("შეიტანეთ ვალიდური კუპიურა (5, 10 ან 20 ლარიანი).")
        continue

    total_paid += bill
    total_due -= bill

    if total_due > 0:
        print(f"დარჩა გადასახდელი თანხა: {total_due} ლარი")
    elif total_due < 0:
        # თუ თანხა 0-ზე ნაკლებია, ესე იგი მომხმარებელმა მეტი შეიტანა
        change = abs(total_due)
        print(f"თანხა განულდა. თქვენი ხურდა შეადგენს: {change} ლარს")
    else:
        print("თანხა სრულად არის გადახდილი. ხურდა არ გეკუთვნით.")
